/* Localizable strings for default.syndtheme
   This file is manually, NOT automatically, generated. */

/* SortType names: */
"kSortType-0"       = "Date";
"kSortType-1"       = "Title";
"kSortType-2"       = "Source";
"kSortType-3"       = "New";

/* TimeSlice names: */
"kTimeSlice-0"      = "All";
"kTimeSlice-1"      = "Today";
"kTimeSlice-2"      = "Yesterday";
"kTimeSlice-3"      = "Last Seven Days";
"kTimeSlice-4"      = "This Month";
"kTimeSlice-5"      = "Last Month";

/* Magic source name: */
"kSourceAll"        = "All";

/* Tooltips for items in source list: */
"kSourceAllToolTip" = "Show articles from all feeds in this group";
"kSourceToolTip"    = "Show only articles from %s";

/* Strings to display when there are no articles; keyed by the current timeslice */
"kNoArticles-0"     = "No Articles";
"kNoArticles-1"     = "No Articles Today";
"kNoArticles-2"     = "No Articles Yesterday";
"kNoArticles-3"     = "No Articles This Week";
"kNoArticles-4"     = "No Articles This Month";
"kNoArticles-5"     = "No Articles Last Month";

/* Strings for the alert banner.  The first version is used when displaying a single feed.  The second version for aggregated feeds.  */
"kAuthenticationAlert-1" = "Safari could not update this feed because it requires authentication.  To retrieve new articles, enter the following information:";
"kAuthenticationAlert-2" = "Safari could not update \"%@\" because the feed requires authentication.  To retrieve new articles, enter the following information:";
"kNotFoundAlert-1"       = "Safari could not update this feed because the source file is no longer available.";
"kNotFoundAlert-2"       = "Safari could not update \"%@\" because the source file is no longer available.";
"kUnknownFormatAlert-1"  = "Safari could not update this feed because the content is not in a known feed format.";
"kUnknownFormatAlert-2"  = "Safari could not update \"%@\" because the content is not in a known feed format.";

"kUsername" = "Username:";
"kPassword" = "Password:";
"kAddToKeychain" = "Add to keychain";
"kUpdate" = "Update";

/* Strings that appear in Article.syntmpl */
"kReadMore" = "Read more&hellip;";

/* Strings that appear in FOAF.syntmpl */
"kFriends"  = "Friends:";
"kAnd"      = "and";
"kMore"     = "more&hellip;";

/* Strings that appear in Feed.html */
"kNew"              = "New";
"kCountSeparator"   = ", ";
"kTotal"            = "Total";
"kSearchArticles"   = "Search Articles:";
"kArticleLength"    = "Article Length:";
"kSortBy"           = "Sort By:";
"kRecentArticles"   = "Recent Articles:";
"kColon"            = ":";                  /* used after group name in sidebar's list of sources */
"kSource"           = "Source:";
"kActions"          = "Actions:";
"kMarkAllArticlesRead" = "Mark All As Read";
"kRefreshFeed"      = "Update Now";
"kEmailSubject"     = "Check out this page";
"kEmailBody"        = "Hi,\n\nI thought you might be interested in this page:";
"kEmailLinkText"    = "Mail Link to This Page";
"kSubscribeInMail"  = "Subscribe in Mail";
"kSubscribeInTunes" = "Subscribe in iTunes";
"kAddBookmark"      = "Add Bookmark&hellip;";
"kBookmarkSearch"   = "Bookmark This Search";
"kBookmarkHelpTag"  = "Bookmark this RSS page to automatically receive new articles.";
"kNoArticles"       = "No Articles";

/* Strings that appear in FeedComplete.html */
"kPreviousPages"         = "previous&hellip;";
"kNextPages"             = "more&hellip;";

/* Strings that appear in Entry.html */
"kIn"         = " in ";     /* used in a construct like "John Doe in NYTimes Top Stories" */

/* Localized date/time formats for use with strftime. See DateClass.cpp */
"TodayFmtCRT"      = "Today, %#I:%M %p";
"YesterdayFmtCRT"  = "Yesterday, %#I:%M %p";
"ThisWeekFmtCRT"   = "%A %#I:%M %p";
"ThisYearFmtCRT"   = "%b %#d, %#I:%M %p";
"PastYearFmtCRT"   = "%b %#d, '%y, %#I:%M %p";

